atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018,2019 Davide Bettio <davide@uninstall.it>
 * Copyright 2019 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>
#ifdef CONFIG_AVM_ENABLE_SOCKET_PORT_DRIVER

#include "port.h"

#include <stdbool.h>
#include <string.h>

#include "atom.h"
#include "context.h"
#include "globalcontext.h"
#include "interop.h"
#include "mailbox.h"
#include "scheduler.h"
#include "sys.h"
#include "term.h"
#include "utils.h"

#include "esp32_sys.h"
#include "platform_defaultatoms.h"

#include <esp_log.h>

#include <lwip/api.h>
#include <lwip/inet.h>
#include <lwip/ip_addr.h>
#include <tcpip_adapter.h>

//#define ENABLE_TRACE 1
#include "trace.h"

static void socket_driver_init(GlobalContext *global);
static Context *socket_driver_create_port(GlobalContext *global, term opts);

static void tcp_server_handler(Context *ctx);
static void tcp_client_handler(Context *ctx);
static void udp_handler(Context *ctx);
static void socket_consume_mailbox(Context *ctx);

static const char *const ealready_atom = "\x8" "ealready";

uint32_t socket_tuple_to_addr(term addr_tuple)
{
    return ((term_to_int32(term_get_tuple_element(addr_tuple, 0)) & 0xFF) << 24)
        | ((term_to_int32(term_get_tuple_element(addr_tuple, 1)) & 0xFF) << 16)
        | ((term_to_int32(term_get_tuple_element(addr_tuple, 2)) & 0xFF) << 8)
        | (term_to_int32(term_get_tuple_element(addr_tuple, 3)) & 0xFF);
}

static term socket_tuple_from_addr(Context *ctx, uint32_t addr)
{
    term terms[4];
    terms[0] = term_from_int32((addr >> 24) & 0xFF);
    terms[1] = term_from_int32((addr >> 16) & 0xFF);
    terms[2] = term_from_int32((addr >> 8) & 0xFF);
    terms[3] = term_from_int32(addr & 0xFF);

    return port_create_tuple_n(ctx, 4, terms);
}

static void tuple_to_ip_addr(term address_tuple, ip_addr_t *out_addr)
{
    out_addr->type = IPADDR_TYPE_V4;
    out_addr->u_addr.ip4.addr = htonl(socket_tuple_to_addr(address_tuple));
}

static term socket_addr_to_tuple(Context *ctx, ip_addr_t *addr)
{
    term addr_tuple;

    switch (IP_GET_TYPE(addr)) {
        case IPADDR_TYPE_V4: {
            uint8_t ad1 = ip4_addr1(&(addr->u_addr.ip4));
            uint8_t ad2 = ip4_addr2(&(addr->u_addr.ip4));
            uint8_t ad3 = ip4_addr3(&(addr->u_addr.ip4));
            uint8_t ad4 = ip4_addr4(&(addr->u_addr.ip4));
            addr_tuple = term_alloc_tuple(4, ctx);
            term_put_tuple_element(addr_tuple, 0, term_from_int11(ad1));
            term_put_tuple_element(addr_tuple, 1, term_from_int11(ad2));
            term_put_tuple_element(addr_tuple, 2, term_from_int11(ad3));
            term_put_tuple_element(addr_tuple, 3, term_from_int11(ad4));
            break;
        }

        case IPADDR_TYPE_V6:
            //TODO: implement IPv6
            addr_tuple = term_invalid_term();
            break;

        default:
            addr_tuple = term_invalid_term();
    }

    return addr_tuple;
}

enum socket_type
{
    TCPServerSocket,
    TCPClientSocket,
    UDPSocket
};

struct SocketData
{
    struct ListHead sockets_head;
    struct netconn *conn;
    Context *ctx;
    enum socket_type type;
    term controlling_process_pid;

    term passive_receiver_process_pid;
    uint64_t passive_ref_ticks;

    int avail_bytes;

    uint16_t port;

    size_t buffer;
    bool active : 1;
    bool binary : 1;
};

struct TCPClientSocketData
{
    struct SocketData socket_data;
};

struct TCPServerSocketData
{
    struct SocketData socket_data;
    int ready_connections;

    struct ListHead accepters_list_head;
};

struct TCPServerAccepter
{
    struct ListHead accepter_head;
    term accepting_process_pid;
    uint64_t ref_ticks;
};

struct UDPSocketData
{
    struct SocketData socket_data;
};

struct NetconnEvent
{
    struct netconn *netconn;
    enum netconn_evt evt;
    u16_t len;
};

xQueueHandle netconn_events = NULL;

void socket_events_handler(EventListener *listener)
{
    TRACE("socket_events_handler\n");

    GlobalContext *glb = listener->data;
    struct ESP32PlatformData *platform = glb->platform_data;

    struct NetconnEvent event;
    while (xQueueReceive(netconn_events, &event, 1) == pdTRUE) {
        TRACE("Got netconn event: %p %i %i\n", event.netconn, event.evt, event.len);

        struct netconn *netconn = event.netconn;
        enum netconn_evt evt = event.evt;
        u16_t len = event.len;

        struct SocketData *socket = NULL;
        struct ListHead *socket_head;
        LIST_FOR_EACH (socket_head, &platform->sockets_list_head) {
            struct SocketData *current_socket = GET_LIST_ENTRY(socket_head, struct SocketData, sockets_head);
            if (current_socket->conn == netconn) {
                socket = current_socket;
            }
        }

        if (socket) {
            if ((evt == NETCONN_EVT_RCVMINUS) /*&& (len != 0)*/) {
                TRACE("Ignoring RCVMINUS event\n");
                continue;
            }

            if ((evt == NETCONN_EVT_SENDMINUS) || (evt == NETCONN_EVT_SENDPLUS)) {
                TRACE("Ignoring SENDMINUS/SENDPLUS event\n");
                continue;
            }

            if (evt == NETCONN_EVT_ERROR) {
                TRACE("Ignoring ERROR event\n");
                continue;
            }

            socket->avail_bytes += len;

            switch (socket->type) {
                case TCPServerSocket:
                    tcp_server_handler(socket->ctx);
                    break;

                case TCPClientSocket:
                    tcp_client_handler(socket->ctx);
                    break;

                case UDPSocket:
                    udp_handler(socket->ctx);
                    break;

                default:
                    fprintf(stderr, "bug: unknown socket type.\n");
            }

        } else {
            TRACE("Got event for unknown conn: %p, evt: %i, len: %i\n", netconn, (int) evt, (int) len);
        }
    }
}

void socket_driver_init(GlobalContext *glb)
{
    TRACE("Initializing socket driver\n");

    netconn_events = xQueueCreate(32, sizeof(struct NetconnEvent));
    EventListener *socket_listener = malloc(sizeof(EventListener));

    struct ESP32PlatformData *platform = glb->platform_data;
    sys_event_listener_init(socket_listener, &netconn_events, socket_events_handler, glb);
    list_append(&platform->listeners, &socket_listener->listeners_list_head);

    list_init(&platform->sockets_list_head);

    TRACE("Socket driver init: done\n");
}

static void socket_data_init(struct SocketData *data, Context *ctx, struct netconn *conn,
    enum socket_type type, struct ESP32PlatformData *platform)
{
    data->type = type;
    data->conn = conn;
    data->ctx = ctx;
    data->controlling_process_pid = term_invalid_term();
    data->port = 0;
    data->active = true;
    data->binary = true;
    data->buffer = 512;

    list_append(&platform->sockets_list_head, &data->sockets_head);

    data->passive_receiver_process_pid = term_invalid_term();
    data->passive_ref_ticks = 0;

    data->avail_bytes = 0;

    ctx->platform_data = data;
}

static struct TCPServerSocketData *tcp_server_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform)
{
    struct TCPServerSocketData *tcp_data = malloc(sizeof(struct TCPServerSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPServerSocket, platform);
    tcp_data->ready_connections = 0;
    list_init(&tcp_data->accepters_list_head);

    return tcp_data;
}

static struct TCPClientSocketData *tcp_client_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform, term controlling_process_pid)
{
    struct TCPClientSocketData *tcp_data = malloc(sizeof(struct TCPClientSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPClientSocket, platform);
    tcp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return tcp_data;
}

static struct UDPSocketData *udp_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform, term controlling_process_pid)
{
    struct UDPSocketData *udp_data = malloc(sizeof(struct UDPSocketData));
    if (IS_NULL_PTR(udp_data)) {
        return NULL;
    }
    socket_data_init(&udp_data->socket_data, ctx, conn, UDPSocket, platform);
    udp_data->socket_data.controlling_process_pid = controlling_process_pid;

