atomvm/AtomVM/src/platforms/esp32/main/socket_driver.c
    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static void do_peername(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_peer(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, term_from_int(result));
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3 + 8) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term addr_term = socket_addr_to_tuple(ctx, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, ctx);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static void do_controlling_process(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);
    term cmd = term_get_tuple_element(msg, 2);

    term new_pid_term = term_get_tuple_element(cmd, 1);
    term return_msg;

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }

    if (UNLIKELY(!term_is_pid(new_pid_term))) {
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, BADARG_ATOM);
    } else if (UNLIKELY(pid != socket_data->controlling_process_pid)) {
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, NOT_OWNER_ATOM);
    } else {
        socket_data->controlling_process_pid = new_pid_term;
        return_msg = OK_ATOM;
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static void socket_consume_mailbox(Context *ctx)
{
    while (!list_is_empty(&ctx->mailbox)) {
        Message *message = mailbox_dequeue(ctx);
        term msg = message->message;

        TRACE("message: ");
        #ifdef ENABLE_TRACE
            term_display(stdout, msg, ctx);
        #endif
        TRACE("\n");

        term cmd = term_get_tuple_element(msg, 2);
        term cmd_name = term_get_tuple_element(cmd, 0);

        switch (cmd_name) {
            //TODO: remove this
            case INIT_ATOM:
                TRACE("init\n");
                do_init(ctx, msg);
                break;

            case SENDTO_ATOM:
                TRACE("sendto\n");
                do_sendto(ctx, msg);
                break;

            case SEND_ATOM:
                TRACE("send\n");
                do_send(ctx, msg);
                break;

            case RECVFROM_ATOM:
                TRACE("recvfrom\n");
                do_recvfrom(ctx, msg);
                break;

            case RECV_ATOM:
                TRACE("recv\n");
                do_recvfrom(ctx, msg);
                break;

            case ACCEPT_ATOM:
                TRACE("accept\n");
                do_accept(ctx, msg);
                break;

            case CLOSE_ATOM:
                TRACE("close\n");
                do_close(ctx, msg);
                break;

            case GET_PORT_ATOM:
                TRACE("get_port\n");
                do_get_port(ctx, msg);
                break;

            case SOCKNAME_ATOM:
                TRACE("sockname\n");
                do_sockname(ctx, msg);
                break;

            case PEERNAME_ATOM:
                TRACE("peername\n");
                do_peername(ctx, msg);
                break;

            case CONTROLLING_PROCESS_ATOM:
                TRACE("controlling_process\n");
                do_controlling_process(ctx, msg);
                break;

            default:
                TRACE("badarg\n");
                break;
        }

        mailbox_destroy_message(message);
    }
}

Context *socket_driver_create_port(GlobalContext *global, term opts)
{
    UNUSED(opts);

    Context *ctx = context_new(global);
    ctx->native_handler = socket_consume_mailbox;
    ctx->platform_data = NULL;
    return ctx;
}

REGISTER_PORT_DRIVER(socket, socket_driver_init, socket_driver_create_port)

#endif
